app/controllers/categories_controller.rb

SELECT  "categories".* FROM "categories" WHERE "categories"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
DELETE FROM "categories" WHERE "categories"."id" = ?  [["id", 1]]
---
  def destroy
    @category=Category.find(params[:id])

    if @category.destroy

SELECT  "categories".* FROM "categories" ORDER BY created_at DESC LIMIT ? OFFSET ?  [["LIMIT", 10], ["OFFSET", 0]]
---
  def index
    if params[:search]
      @categories =Category.search(params[:search]).all.order("created_at DESC").paginate(:per_page => 10, :page => params[:page])

SELECT  "categories".* FROM "categories" WHERE "categories"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]
SELECT "images".* FROM "images" WHERE (category_id == 2)
SELECT "categories".* FROM "categories"
---
  def show
    @category=Category.find(params[:id])
    @images=Image.find_by_category(@category)
    @categories=Category.all