app/controllers/images_controller.rb

INSERT INTO "images" ("image", "image_title", "image_file_size", "image_content_type", "image_description", "category_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @image=Image.new(image_param)
    if @image.save

SELECT  "images".* FROM "images" WHERE "images"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
DELETE FROM "images" WHERE "images"."id" = ?  [["id", 1]]
---
  def destroy
    @image=Image.find(params[:id])

    if @image.destroy

SELECT "categories".* FROM "categories"
SELECT "images".* FROM "images"
---
  def home
    @categories=Category.all
    @images=Image.all

SELECT  "images".* FROM "images" ORDER BY created_at DESC LIMIT ? OFFSET ?  [["LIMIT", 10], ["OFFSET", 0]]
SELECT COUNT(*) FROM "images"
---
  def index
    if params[:search]
      @images =Image.search(params[:search]).all.order("created_at DESC").paginate(:per_page => 10, :page => params[:page])