app/views/images/new.html.erb

SELECT "categories".* FROM "categories"
---
    <%= f.label :category%>
    <%= f.select :category_id,
        Category.all.collect {|item| [item.name,item.id]},
        {:include_blank => "Select One"},
        class:"form-control" %>